import { type } from "./type.js"
import gradient from "gradient-string"
export async function boot() {
  await type("Inicializando sistema...", 20)
  await type("Carregando módulos...", 15)
  await type("Verificando integridade...", 15)
  await type("Sistema pronto.\n", 20)
  console.log(gradient(['red', 'orange']).multiline(`
     ██╗██╗   ██╗███████╗████████╗██╗  ██╗███████╗     ██████╗██╗     ██╗
     ██║██║   ██║██╔════╝╚══██╔══╝██║ ██╔╝██╔════╝    ██╔════╝██║     ██║
     ██║██║   ██║███████╗   ██║   █████╔╝ █████╗      ██║     ██║     ██║
██   ██║██║   ██║╚════██║   ██║   ██╔═██╗ ██╔══╝      ██║     ██║     ██║
╚█████╔╝╚██████╔╝███████║   ██║   ██║  ██╗███████╗    ╚██████╗███████╗██║
 ╚════╝  ╚═════╝ ╚══════╝   ╚═╝   ╚═╝  ╚═╝╚══════╝     ╚═════╝╚══════╝╚═╝
    `))
  console.log(`
┌─────────────────────────────┐
│   Bem Vindo ao JUSTKE CLI   │
└─────────────────────────────┘
Seja bem vindo ao JUSTKE CLI, uma ferramenta de linha de comando para você me conhecer melhor e se divertir com meus comandos. Para começar, digite "justke help" para ver a lista de comandos disponíveis. Aproveite!
`)
}
